Case3_MeshExtA/0/alphat.steam
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat.steam;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    inlet_secundario
    {
        type            calculated;
        value           uniform 1e-8;
    }

    outlet_secundario
    {
        type            calculated;
        value           uniform 1e-8;
    }
   	
	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

	region0_to_solido
	{
        type            compressible::alphatWallBoilingWallFunction;
        otherPhase      water; //liquid;
        phaseType       vapor;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        partitioningModel
        {
            type        Lavieville;
            alphaCrit   0.2;
        }
        value           uniform 0;
    }
    
    pared
	{
         type            compressible::alphatPhaseChangeJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;

        value           uniform 1e-8;
    }

}


// ************************************************************************* //
