Case3_MeshExtA/0/anulo/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/agua";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 588;

boundaryField
{
    inlet_primario
    {
        type            fixedValue;
        value           uniform 590;
    }
    outlet_primario
    {
		type            zeroGradient;
    }
    
	anulo_to_solido
    {
		type          compressible::turbulentTemperatureCoupledBaffleMixed_Modif2;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
		TwoFluidAcoupled   false;
		TypeRegion         fluido;              
		//Esto lo activo cuando acoplo una region de dos fluidos
		// con un solido o una region monofasica   
	}

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

pared
	{
		 type            zeroGradient;
	}
}


// ************************************************************************* //
