Case3_MeshExtA/0/anulo/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/agua";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -6.2253);

boundaryField
{
    inlet_primario
    {
        type            fixedValue;
        value           uniform (0 0 -6.2253);        
    }
    outlet_primario
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

	anulo_to_solido
    {
		type            fixedValue;
        value           uniform (0 0 0);
	}

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

pared
	{
		 type            fixedValue;
        value           uniform (0 0 0);
	} 

}

// ************************************************************************* //
