Case3_MeshExtA/0/anulo/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/agua";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{    
    inlet_primario
    {
        type            calculated;
        value           uniform 0;
    }
    outlet_primario
    {
        type            calculated;
        value           uniform 0;
    }

	anulo_to_solido
    {
		type            compressible::alphatWallFunction;
        value           uniform 0;
	}

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

	pared
    {
		type            compressible::alphatWallFunction;
        value           uniform 0;
	}


}


// ************************************************************************* //
