Case3_MeshExtA/0/anulo/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/agua";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 11.50;

boundaryField
{    
    inlet_primario
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet_primario
    {
        type            zeroGradient;
    }    

	anulo_to_solido
    {
		type            epsilonWallFunction;
        value           $internalField;
	}

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

pared
    {
		type            epsilonWallFunction;
        value           $internalField;
	}

}


// ************************************************************************* //
