Case3_MeshExtA/0/anulo/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/agua";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{   
    inlet_primario
    {
	type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;
        value           $internalField;
    }
    outlet_primario
    {
        type            zeroGradient;
    }
	anulo_to_solido
    {
		type            kqRWallFunction;
        value           $internalField;
	}

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }


	pared
	{
		 type            kqRWallFunction;
        value           $internalField;
	}

}


// ************************************************************************* //
