Case3_MeshExtA/0/anulo/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/agua";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 11e6;

boundaryField
{
    inlet_primario
    {
        type            calculated;
        value           uniform 11e6;
    }
    outlet_primario
    {
        type            calculated;
        value           uniform 11e6;
    }
    
	anulo_to_solido 
    {
		type            calculated;
        value           uniform  11e6;
	}

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

pared
	{
		type            calculated;
        value           uniform 11e6;
	} 

}


// ************************************************************************* //
