Case3_MeshExtA/0/anulo/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/primario";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 11e6;

boundaryField
{
    inlet_primario
    {
        type            fixedFluxPressure;
    }
    outlet_primario
    {
        type            fixedValue;
        value           uniform 11e6;
    }
   
	anulo_to_solido
    {
		type            fixedFluxPressure;
	}

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }


	pared
    {
		type            fixedFluxPressure;
	}


}


// ************************************************************************* //
