Case3_MeshExtA/0/nut.steam
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut.steam;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    inlet_secundario
    {
        type            calculated;
        value           uniform 1e-8;
    }

    outlet_secundario
    {
        type            calculated;
        value           uniform 1e-8;
    }

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

	region0_to_solido
	{
        type            nutkWallFunction;
        value           uniform 1e-8;
    }

pared
	{
        type            nutkWallFunction;
        value           uniform 1e-8;
    }

}


// ************************************************************************* //
