Case3_MeshExtA/0/omega.steam
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega.steam;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0]; 

internalField   uniform 277;

boundaryField
{
    inlet_secundario
    {
        type            fixedValue;
	  	value           uniform 277;
    }

    outlet_secundario
    {
         type            inletOutlet;
        phi             phi.water;
        inletValue      $internalField;
        value           $internalField;
    }
    
	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }
	region0_to_solido
    {
        type            omegaWallFunction;
        value           uniform 56.322;
    }
    pared
    {
        type            omegaWallFunction;
        value           uniform 56.322;
    }
}


// ************************************************************************* //

