Case3_MeshExtA/0/solido/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solido";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{    
	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

	pared
	{
	    type            calculated;
    	value           $internalField;
    }

	solido_to_anulo
    {
	    type            calculated;
    	value           $internalField;
    }
    solido_to_region0
    {
		type            calculated;
       	value           $internalField;
    }

}


// ************************************************************************* //
