Case3_MeshExtA/constant/anulo/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/shell";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Propiedades del agua a 11Mpa. Valores promedios entre 590 y 586 K

    specie
    {
        molWeight       18.02;
    }
    equationOfState
    {
        rho             680.3; 
    }
    thermodynamics
    {
        Cp              6289; 
        Hf              0;
    }
    transport
    {
        mu              8.49e-5; 
        Pr              1.031091;
    }
}

// ************************************************************************* //
