Case3_MeshExtA/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.0001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          5000;
        startFace       9730;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          5000;
        startFace       14730;
    }
    outlet_secundario
    {
        type            patch;
        nFaces          20;
        startFace       19730;
    }
    inlet_secundario
    {
        type            patch;
        nFaces          20;
        startFace       19750;
    }
    pared
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          150;
        startFace       19770;
    }
    region0_to_solido
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       19920;
        sampleMode      nearestPatchFace;
        sampleRegion    solido;
        samplePatch     solido_to_region0;
    }
)

// ************************************************************************* //
