Case3_MeshExtA/constant/solido/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.0001/solido/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          500;
        startFace       895;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          500;
        startFace       1395;
    }
    pared
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       1895;
    }
    solido_to_region0
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1905;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_solido;
    }
    solido_to_anulo
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       2005;
        sampleMode      nearestPatchFace;
        sampleRegion    anulo;
        samplePatch     anulo_to_solido;
    }
)

// ************************************************************************* //
