Case3_MeshExtA/system/anulo/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/porous";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	rho
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0.1;
    }


    "p_rgh.*"
    {

	solver		PBiCGStab;
	preconditioner	DIC;
        tolerance        1e-9;
        relTol           0.01;
        smoother         DIC;
        maxIter          80;
    }

    "(U|h|e|k|epsilon|omega).*"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

	rhoFinal
    {
		$rho;
        relTol          0;  
    }

}

PIMPLE
{
    nCorrectors         4;
    nNonOrthogonalCorrectors 3;
}

relaxationFactors
{
    fields
    {
        rho             1;
        p_rgh           0.7;
    }

    equations
    {
        U               0.3;
        "(h|e)"         0.3;
        k               0.3;
        epsilon         0.3;
	omega         0.3;
    }
}


// ************************************************************************* //
