Case3_MeshExtA/system/postproceso/alphaAverageOutlet
// Alpha total a la salida
	
	Alpha_Total_outlet
    {
		//OpenFOAM 4		
		type             surfaceFieldValue;
        libs ("libfieldFunctionObjects.so");
        enabled         true;
		region          region0;
        writeControl    timeStep; //writeTime;   
        writeFields     false; //true;
        regionType      patch;
        name      		outlet_secundario;
        // Operation: areaAverage/sum/weightedAverage ...
        operation       average; //weightedAverage; //average; //areaAverage; //weightedAverage; // banana; //sum; 

//		weightField     phi.steam;

        fields
        (
            alpha.steam       
        );		
    }




