Case3_MeshExtA/system/postproceso/averageFields
// Obtengo los campos promedios

	fieldAverage2
    {
        type            fieldAverage;
        libs ( "libfieldFunctionObjects.so" );
        writeControl    writeTime;
		region          region0;
        fields
        (	
			p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.steam
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.steam
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            T.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

			wDmdt.steamAndWater
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

			iDmdt.steamAndWater
			{
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }


        );
    }
