Case3_MeshExtA/system/postproceso/averageFieldsAnulo
// Obtengo los campos promedios

	fieldAverage1
    {
        type            fieldAverage;
        libs ( "libfieldFunctionObjects.so" );
        writeControl    writeTime;
		region          anulo;
        fields
        (
			T
			{
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

			U
			{
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }           

        );
    }
