Case3_MeshExtA/system/postproceso/caudalPrimario
// Caudal a la salir


	Salida_primario
   {
       type            surfaceFieldValue;
       functionObjectLibs ("libfieldFunctionObjects.so");   
	   //log             true;
		region          anulo;
       writeControl    timeStep;
       writeFields     false;

       regionType      patch;
       name            outlet_primario;
       operation       sum;
		//surfaceFormat raw;

       fields
       (
           phi
       );
   }




/*
	rhoPhi
    {
		//OpenFOAM 7		
		type              surfaceFieldValue;
        libs ("libfieldFunctionObjects.so");
        enabled         true;
		region          region0;
        writeControl    timeStep; //writeTime;   
        writeFields     false; //true;
        regionType      patch;
        name      		outlet;
        // Operation: areaAverage/sum/weightedAverage ...
        operation       sumMag; //areaAverage*sum; //weightedAverage; // banana; //sum; 

        fields
        (
             rhoPhiSteam rhoPhiWater
        );		
    }

	/*rhoPhisteam
    {
		//OpenFOAM 7		
		type              surfaceFieldValue;
        libs ("libfieldFunctionObjects.so");
        enabled         true;
		region          region0;
        writeControl    timeStep; //writeTime;   
        writeFields     false; //true;
        regionType      patch;
        name      		outlet;
        // Operation: areaAverage/sum/weightedAverage ...
        operation       sumMag; //areaAverage*sum; //weightedAverage; // banana; //sum; 

        fields
        (
             rhoPhiSteam
        );		
    }*/


/*
VentEquipo
   {
       type            surfaceFieldValue;
       functionObjectLibs ("libfieldFunctionObjects.so");
   
log             true;
       writeControl    timeStep;
       writeFields     true;

       regionType      faceZone;
       name            VentEquipo;
       

operation       sumDirectionBalance;
direction (1 0 0);
surfaceFormat raw;

       orientedFields
       (
           phi
       );
fields
       (
         //
       );
   }*/
