Case3_MeshExtA/system/postproceso/planospromediosPesado
//Mido los valores promedios en planos sucesivos
		Plano0
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano0;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0);
							normal  (0 0 1);
						}
					type            plane;    
				}
		
				operation       weightedAverage; //average; //areaAverage; //weightedAverage; // banana; //sum; 

				weightField     phi;


				operation       average;
				fields
				(
				     alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }


		Plano1
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano1;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.0075);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean 
				);
        }

		Plano2
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano2;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.015);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano3
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano3;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.0225);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano4
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano4;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.03);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano5
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl    writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano5;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.0375);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano6
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano6;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.045);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano7
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano7;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.0525);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano8
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano8;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.06);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }


		Plano9
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano9;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.0675);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano10
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano10;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.075);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano11
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano11;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.0825);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano12
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano12;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.09);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano13
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano13;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.0975);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano14
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano14;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.105);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano15
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano15;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.1125);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano16
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano16;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.12);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano17
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano17;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.1275);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano18
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano18;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.135);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano19
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano19;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.1425);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano20
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano20;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.15);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano21
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano21;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.1575);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano22
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano22;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.165);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano23
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano23;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.1725);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano24
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano24;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.18);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano25
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano25;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.1875);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano26
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano26;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.195);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano27
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano27;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2025);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano28
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano28;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.21);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano29
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano29;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2175);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano30
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano30;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.225);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano31
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano31;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2325);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano32
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano32;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.24);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano33
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano33;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2475);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano34
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano34;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.255);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano35
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano35;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2625);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano36
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano36;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.27);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano37
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano37;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2775);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano38
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano38;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.285);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano39
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano39;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2925);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

		Plano40
        {
                type            surfaceFieldValue;
                functionObjectLibs ("libfieldFunctionObjects.so");
				region          region0;
				writeControl     writeTime;        		
				writeFields     false;                
				regionType      sampledSurface;
                name			Plano40;
				sampledSurfaceDict
				{
					planeType       pointAndNormal;
					pointAndNormalDict
					{
							point   (0.00384 0 0.2999);
							normal  (0 0 1);
						}
					type            plane;    
				}
				
				operation       average;
				fields
				(
				    alpha.steam alpha.steamMean T.waterMean T.water U.waterMean U.steamMean U.steam iDmdt.steamAndWaterMean wDmdt.steamAndWaterMean
				);
        }

